Revit 2026 API

# GeometryCreationUtilitiesCreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop, XYZ, SolidOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid CreateFixedReferenceSweptGeometry(
	CurveLoop sweepPath,
	int pathAttachmentCrvIdx,
	double pathAttachmentParam,
	IList<CurveLoop> profileLoops,
	XYZ fixedReferenceDirection,
	SolidOptions solidOptions
)
```
```vb
Public Shared Function CreateFixedReferenceSweptGeometry (
	sweepPath As CurveLoop,
	pathAttachmentCrvIdx As Integer,
	pathAttachmentParam As Double,
	profileLoops As IList(Of CurveLoop),
	fixedReferenceDirection As XYZ,
	solidOptions As SolidOptions
) As Solid
```
```cpp
public:
static Solid^ CreateFixedReferenceSweptGeometry(
	CurveLoop^ sweepPath,
	int pathAttachmentCrvIdx,
	double pathAttachmentParam,
	IList<CurveLoop^>^ profileLoops,
	XYZ^ fixedReferenceDirection,
	SolidOptions^ solidOptions
)
```
```fsharp
static member CreateFixedReferenceSweptGeometry :
        sweepPath : CurveLoop *
        pathAttachmentCrvIdx : int *
        pathAttachmentParam : float *
        profileLoops : IList<CurveLoop> *
        fixedReferenceDirection : XYZ *
        solidOptions : SolidOptions -> Solid
```

#### Parameters

sweepPath CurveLoop

pathAttachmentCrvIdx Int32

pathAttachmentParam Double

profileLoops IListCurveLoop

fixedReferenceDirection XYZ

solidOptions SolidOptions

#### Return Value

Solid

#### Reference

GeometryCreationUtilities Class

CreateFixedReferenceSweptGeometry Overload

Autodesk.Revit.DB Namespace